In [1]:
import pandas as pd

# b)	Write the query that shows how many duplicate records are there? Further fetch all the duplicate records.
# c)	Write the query to find the count of each designation in the data? 
# d)	Remove the duplicate record from the employee data frame.
# e)	Write the code to fill the missing value of the Salary, Department, Age columns? Discuss your choice of value, like a hard coded value, a mean, median, mode of the column?
# f)	Write the code to find the average salary of the accounts department.
# g)	What the Emp_ID of the manager having the highest salary
# h)	What is the average age of the Officers in the company?
# i)	Write the query to show how many employees are working in IT department?
# j)	After cleaning the employee data set, save the data set in csv format in a file named as ‘employee.csv’.

In [14]:
data = pd.read_excel("employee.xlsx" , index_col="Serial")

In [15]:
data

        Emp_ID Designation  Department   Age    Salary
Serial
1         1101     Manager    Accounts  50.0  200000.0
2         1107     Officer          IT  30.0   80000.0
3         1203     Officer          HR  28.0       NaN
4         1005     Manager          HR  45.0  120000.0
5         2123  Office Boy    Accounts  27.0   45000.0
6         2451  Accountant         NaN  34.0  100000.0
7         1111  Accountant    Accounts   NaN  110000.0
8         1001     Officer          IT  25.0   75000.0
9         1234     Manager          IT  23.0       NaN
10        2156    Engineer  Production  45.0   89000.0
11        6543     Officer  Production  29.0  100000.0
12        3214  Accountant     Account  49.0  123000.0
13        2156    Engineer  Production  45.0   89000.0
14        1098     Officer          IT  25.0  100000.0
15        2912     Officer          IT  31.0   90000.0
16        1222     Officer         NaN  25.0       NaN
17        2156    Engineer  Production  45.0   89000.0
18        2123  Office Boy    Accounts  27.0   45000.0

# b) Write the query that shows how many duplicate records are there? Further fetch all the duplicate records.

In [22]:
data.duplicated().sum()

3

In [35]:
data[data.duplicated()]

Empty DataFrame
Columns: [Emp_ID, Designation, Department, Age, Salary]
Index: []

# c) Write the query to find the count of each designation in the data?

In [25]:
data.Designation.value_counts()

Designation
Officer       7
Manager       3
Accountant    3
Engineer      3
Office Boy    2
Name: count, dtype: int64

# d) Remove the duplicate record from the employee data frame.

In [32]:
data.drop_duplicates(inplace=True)

## checking duplicates record again

In [34]:
data.duplicated().sum()

0

# e) Write the code to fill the missing value of the Salary, Department, Age columns? Discuss your choice of value, like a hard coded value, a mean, median, mode of the column?